
let arr = [3, 5, -7, 4, 10, -6, 1, 8 ,-9, 2];  

// ********** Insertion Sort ********** 
function insertionSort(arr){

    let tmpNum = 0 // -> משתנה עזר לביצוע ההחלפה
    let index = 0  // -> משתנה לקידום האיבר הקטן שנמצא 
    //  לתחילת המערך ע"י ביצוע החלפה כל עוד התנאי בלולאת וואיל מתקיים
       for(let i = 1 ; i < arr.length ; i++){     
         index = i
         while(index > 0 && arr[index - 1] > arr[index]){  
         // הרעיון במיון הזה למצוא איבר קטן ולמיין מהמקום שלו עד תחילת המערך 
         // בכל מחזור של לולאת פור  
         // אם האיבר הקודם גדול מהאיבר הבא הלולאה תתחיל לבצע החלפות 
         // ותקדם את האיבר הקטן שנמצא מהאינדקס לתחילת המערך  
         // האינדקס מקבל את המיקום מלולאת פור ויורד באחד בכל איטרציה עד שהתנאי נהיה שקר   
         // בלולאת פור עולה באחד ומתחיל סיבוב חדש i וה
         // .הערך הקטן שנמצא נדחף בהחלפות לתחילת המערך כל עוד התנאי מתקיים 
         // הלולאה ממיינת את האיברים מהאינדקס עד תחילת המערך 
         // כך שבכל סיבוב כשיימצא איבר קטן נוסף התהליך יחזור על עצמו 
           tmpNum = arr[index - 1];
           arr[index - 1] = arr[index];
           arr[index] = tmpNum;
           index--      
         }     
       }  
    return arr
}
console.log(insertionSort(arr))