
let arr = [3, 5, -7, 4, 10, -6, 1, 8 ,-9, 2];  

// ********** selection sort ********** 
function selectionSort(arr){
    let tmpNum = 0 //-> משתנה עזר לביצוע ההחלפה
    let index = 0  //-> משתנה שממנו תתחיל לרוץ לולאת פור
    let min = 0    //-> משתנה שמקבל את הערך הנמוך שנמצא
      do{ 
        // .לולאת פור מחפשת את האיבר הקטן במערך 
        // אם נמצא הוא יתחלף עם האיבר הראשון במערך
        // אח"כ עם האיבר השני, השלישי וכך ילאה
        min = index
        for(i = index ; i < arr.length  ; i++){       
          if(arr[i] < arr[min]){       
            min = i        
          }        
        }
        // הרעיון כאן למצוא את האיבר הקטן ביותר ולהעביר אותו לתחילת המערך   
        // האיבר הקטן שנמצא מוחלף עם האיבר הראשון במערך 
        // האינדקס יתקדם באחד ולולאת פור תסרוק מהאידנקס עד סוף המערך
        // והאיבר הקטן שיימצא יכנס לתא 2 האינדקס יעלה ב 1 ולולאת פור תרוץ ממנו 
        // ותבצע החלפות עד סוף התהליך     
        tmpNum = arr[index]
        arr[index] = arr[min]
        arr[min] = tmpNum    
        index++     
      }while(index < arr.length)  
      return arr
}
console.log(selectionSort(arr))